Returns true when Temporary View Properties mode is in progress, false otherwise.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool IsTemporaryViewPropertiesModeEnabled()
  Visual Basic
Public Function IsTemporaryViewPropertiesModeEnabled As Boolean
  Visual C++
public:
bool IsTemporaryViewPropertiesModeEnabled()
 See Also
  View Class
  Autodesk.Revit.DB Namespace